; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image3 - mode
	spectrograph5 - mode
	infrared0 - mode
	thermograph2 - mode
	thermograph6 - mode
	thermograph1 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph6)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph5)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(have_image Star5 thermograph1)
	(have_image Star5 infrared0)
	(have_image Phenomenon6 spectrograph5)
	(have_image Planet7 infrared0)
	(have_image Planet7 thermograph6)
	(have_image Planet8 infrared0)
	(have_image Star9 spectrograph4)
	(have_image Star9 infrared0)
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 spectrograph5)
	(have_image Phenomenon12 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 12
5. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 1 of 12
6. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 1 of 12
7. (take_image satellite0 star5 instrument0 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 2 of 12
9. (take_image satellite0 planet7 instrument0 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 3 of 12
10. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 12
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 12
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
13. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 3 of 12
14. (turn_to satellite0 phenomenon12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 12
15. (take_image satellite0 phenomenon12 instrument1 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 12
16. (turn_to satellite0 phenomenon6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 12
17. (take_image satellite0 phenomenon6 instrument1 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 5 of 12
18. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 5 of 12
19. (take_image satellite0 planet7 instrument1 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 6 of 12
20. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 6 of 12
21. (take_image satellite0 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 7 of 12
22. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 7 of 12
23. (take_image satellite0 star10 instrument1 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 8 of 12
24. (turn_to satellite0 star5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star5)
   goals met: 8 of 12
25. (take_image satellite0 star5 instrument1 infrared0)
   added: (have_image star5 infrared0)
   goals met: 9 of 12
26. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 9 of 12
27. (take_image satellite0 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 12
28. (turn_to satellite0 phenomenon11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon11)
   goals met: 11 of 12
29. (take_image satellite0 phenomenon11 instrument1 spectrograph5)
   added: (have_image phenomenon11 spectrograph5)
   goals met: 12 of 12
